Merge pull request #7 from TamarHagbiy/add_more_game_option
Add more game option
